Autodesk.Revit.DB.MaterialFunctionAssignment
Used in class CompoundStructure to specify the function of a layer.
Remarks:
The function is used primarily to determine
layer priority which affects how layers of distinct elements interact at a join. Typically, layers penetrate
lower priority layers and merge with layers of the same priority.
Since:
2012

Autodesk.Revit.DB.MaterialFunctionAssignment.StructuralDeck
Indicates layer is a structural deck.

Autodesk.Revit.DB.MaterialFunctionAssignment.Membrane
A membrane layer must have thickness 0. It is not represented graphically.

Autodesk.Revit.DB.MaterialFunctionAssignment.Finish2
Priority = 5

Autodesk.Revit.DB.MaterialFunctionAssignment.Finish1
Priority = 4

Autodesk.Revit.DB.MaterialFunctionAssignment.Insulation
Priority = 3

Autodesk.Revit.DB.MaterialFunctionAssignment.Substrate
Priority = 2

Autodesk.Revit.DB.MaterialFunctionAssignment.Structure
Priority = 1 (highest priority)

Autodesk.Revit.DB.MaterialFunctionAssignment.None
Priority = 0 This is deprecated and should not be used.